In [1]:
# first i will learn Hierarchical indexing
### 8.1 Hierarchical Indexing

In [2]:
import numpy as np
import pandas as pd

In [33]:
data=pd.Series(np.random.randn(8),
                 index=[['a','b','c','a','b','c','a','c'],
                  [1,2,3,1,2,2,3,3]])

In [34]:
data.index

MultiIndex([('a', 1),
            ('b', 2),
            ('c', 3),
            ('a', 1),
            ('b', 2),
            ('c', 2),
            ('a', 3),
            ('c', 3)],
           )

In [41]:
data.sort_index()

a  1   -0.306619
   1    0.200165
   3   -0.274588
b  2   -1.243082
   2   -0.072695
c  2    1.374094
   3   -0.262068
   3    0.504777
dtype: float64

In [42]:
data

a  1   -0.306619
b  2   -1.243082
c  3   -0.262068
a  1    0.200165
b  2   -0.072695
c  2    1.374094
a  3   -0.274588
c  3    0.504777
dtype: float64

In [37]:
data.loc[["a","b"]]

a  1   -0.306619
   1    0.200165
   3   -0.274588
b  2   -1.243082
   2   -0.072695
dtype: float64

In [43]:
data.loc[:,2]

b   -1.243082
b   -0.072695
c    1.374094
dtype: float64

In [45]:
#With a DataFrame, either axis can have a hierarchical index
# [18]
import pandas as pd
import numpy as np
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
        index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
        columns=[['Ohio', 'Ohio', 'Colorado'],
        ['Green', 'Red', 'Green']])
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
display(frame)
frame['Ohio']

#Be careful to distinguish the index names 'state' and 'color'
#from the row labels

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [50]:
frame.swaplevel('key2',"key1").sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [51]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [52]:
frame.stack()

state            Colorado  Ohio
key1 key2 color
a    1    Green       2.0     0
          Red         NaN     1
     2    Green       5.0     3
          Red         NaN     4
b    1    Green       8.0     6
          Red         NaN     7
     2    Green      11.0     9
          Red         NaN    10

In [53]:
frame.stack().unstack()

state     Colorado      Ohio
color        Green Red Green Red
key1 key2
a    1         2.0 NaN     0   1
     2         5.0 NaN     3   4
b    1         8.0 NaN     6   7
     2        11.0 NaN     9  10

## from sir Qasim

In [54]:
df1 = pd.DataFrame({"CNIC": np.random.randint(1,20, size=20),
                   "Account No":np.random.randint(1,5, size=(20))})

df1.drop_duplicates(inplace=True)
df1
#12345-1234567-3
#1234512345673

    CNIC  Account No
0     16           3
1     11           2
2      1           2
3      2           2
4     18           3
5      4           3
6      8           3
7     13           1
8      9           3
9      8           2
10     2           3
11    19           1
12     5           2
13    13           2
14    19           3
15     8           1
18    17           3
19     1           4